{
  "top_albums": [
    {
      "artist": "Beach House",
      "label": "Sub Pop",
      "release": "Teen Dream",
      "description": "This in my opinion was not only the best album of 2010 but could also be considered one of the best albums of the past decade. I think a true testament to what makes an album great is an ability to still move you months after it has been released. Teen Dream came out in January and it's been nearly a full year and I still absolutely adore it just as much, if not more, then when I first heard it. Just a beautiful record from start to finish and also one of the most romantic albums to come out in quite some time. —Mike Pakowski"
    },
    {
      "artist": "LCD Soundsystem",
      "label": "DFA",
      "release": "This Is Happening",
      "description": "As confirmed by James Murphy, this album doesn’t signal the end of LCD Soundsystem per se, but future endeavours may involve less touring in support. Or more. Their previous long-play outing, Sound Of Silver, is still a high-rotate turntable showing at the Kiwi pad, but it’s in the live arena – festival or club - where LCD come into their own. Their Coachella performance closing out Friday night was a weekend highlight, 20-ft disco ball and all, and similarly the Metro performance threatened to tear the roof off the sucker. And yes, Nancy rocks! Fave tracks? Opener Dance Yrself Clean, Pow Pow, I Can Change. —Owen Harris"
    },
    {
      "artist": "The National",
      "label": "4AD",
      "release": "High Violet",
      "description": "The essential National style did not change on this album. But they found a way to make their subtly anthemic rock sound even fuller without overwhelming their center, singer Matt Berninger. Combined with wise lyrics tackling adult themes, the band proves that you can be a grown up without making Dad Rock. —Mike Bennet"
    },
    {
      "artist": "Janelle Monáe",
      "label": "Atlantic",
      "release": "The Archandroid",
      "description": "It’s a little bit rock and a little bit soul and a little bit hip hop and a little bit 1960’s Disney musical. Janelle Monáe debut full-length album is impressively diverse, but more importantly, it works, start to finish. It’s also proof that the album format is still vital – don’t just buy the songs you like from iTunes, buy the whole thing and listen to it start to finish. —Tony Breed"
    },
    {
      "artist": "The Tallest Man on Earth",
      "label": "Dead Oceans",
      "release": "The Wild Hunt",
      "description": "Obtuse but intriguing lyrics, impassioned but challenging vocals, and the ability to hold an audience in the palm of his hand make this the best early Dylan record since 1963. —Shawn Campbell"
    },
    {
      "artist": "Kanye West",
      "label": "Def Jam",
      "release": "My Beautiful Dark Twisted Fantasy",
      "description": "Love him or hate him, Kanye knows how to get your attention. After a pretty rough couple of years, West came hurdling through the haters with his most epic release to date, dropping My Beautiful Dark Twisted Fantasy as his musical redemption. West proves he’s got power with his sleek beats, addicting hooks and rhymes (seriously, who else can get the masses singing toasts to ‘douchebags’?) and featured partners in crime ranging from Elton John, Jay-Z to Bon Iver. —Jodi Root"
    },
    {
      "artist": "The Arcade Fire",
      "label": "Merge",
      "release": "The Suburbs",
      "description": "Best Track: 'We Used To Wait' – Pounding pianos, a spectacular interactive music video, plus the haunting vocals that have become synonymous with the Arcade Fire's orchestral style make this a standout song this year. —Carolyn Kassnoff"
    },
    {
      "artist": "Joanna Newsom",
      "label": "Drag City",
      "release": "Have One on Me",
      "description": "Aside from the sheer fact of its girth and its packaging (three discs, six songs each, three songs per side, amazing artwork / photography of Ms. Newsom) the album showed a new level of her songwriting lyrically, pushing out of the symbolic and into the intimate. On her two previous albums she would dress up what the songs were really saying in strange fantastical characters (a bear, a taxidermied dove), but on this one she would tell it to you straight: 'It does not suffice to merely lie beside each other as those who love each other do.' While this kind of confessional emo-ness is the norm for other songwriters, for Joanna Newsom it is, in a way, letting her guard down, letting the audience inside to see something truer. And the songs that seemed dense and evasive still also seemed like veiled metaphors for this same relationship and its ultimate demise. This was my favorite album of the year. —Bobby Evers"
    },
    {
      "artist": "Four Tet",
      "label": "Domino",
      "release": "There Is Love In You",
      "description": "I was wary of Kieren Hebden’s foray into techno with 2007’s Ringer EP, given what a fan I was of his earlier work and his previously glitchy, jazz-inflected sonic palette. But There is Love In You brought me back. Sprawling and ambitious, club-tested at London’s legendary Plastic People, Love in You is a near-perfect album. It’s dark but warm, mechanical and organic all at once, and the reassembled vocal snippets convey a beauty that lyrics could not. Absolutely stunning. —Billy Kalb"
    },
    {
      "artist": "Disappears",
      "label": "Kranky",
      "release": "Lux",
      "description": "This one’s for the record collectors. Probably my favorite Chicago live band, Disappears had some trouble getting this out; when Lux finally arrived, it felt as much like a sigh of relief as anything else. Good news followed a good year for the band: Follow-up LP Guider arrives in January 2011. Mark your calendars. —Patrick Masterson"
    },
    {
      "artist": "Robyn",
      "label": "Konichiwa",
      "release": "Body Talk",
      "description": "Before Pitchfork this summer, I liked Robyn. After Pitchfork this summer, I LOVED her. It was something like 4000 degrees the day of her performance and there's this pale little pixie decked out in a leather and knit dress, dancing and singing her heart out. She never missed a beat and kept the crowd on its feet the whole time. She even swore in two languages when talking about how hot it was. Oh, Robyn. You made my bitter, shriveled heart grow at least three sizes that day. Finally! An intelligent woman who calls her own shots on her own label, no less, and plays awesome pop music you don't feel guilty for loving. This is pop perfection. Thank you, Robyn!! —Nicole Oppenheim"
    },
    {
      "artist": "Superchunk",
      "label": "Merge",
      "release": "Majesty Shredding",
      "description": "Yes! Yes! Yes! Yes! Yes! This is the album that the 18 year old version of myself expected to hear as a follow up to Here's Where The Strings Come In. —Mike Gibson"
    },
    {
      "artist": "Ariel Pink Haunted Graffiti",
      "label": "4AD",
      "release": "Before Today",
      "description": "Best Tracks: 'Hot Body Rub', 'Round And Round' b/w 'Little Wig' - At first you think this is a joke but then the massive genius ambition grabs you. I never thought or I forgot how making this kind of music could be possible. Thanks to this record, I hope more of this kind of music begins to exist. Amazing harmonies and awesome hooks abound. Refrain from ignoring “Butt-House Blondies”. The song has substantial meritas actioni! —Jon Schech"
    },
    {
      "artist": "Judson Claiborne",
      "label": "La Société Expéditionnaire",
      "release": "Time and Temperature",
      "description": "No band this year wrote a better song about cannibalism. Chicago’s own Judson Claiborne put together a fantastic full-length of moody folk-rock in 2010, and if you haven’t heard it, you’re doing yourself a considerable disservice. Sometimes haunting and bible-black, other times bursting with joy, Time and Temperature is one of the most honest, rewarding, and genuinely likeable records I heard this year. Check it out. —Billy Kalb"
    },
    {
      "artist": "Tame Impala",
      "label": "Modular",
      "release": "Innerspeaker",
      "description": "When describing a good music review, CHIRP music director, Billy Kalb, once noted, 'Be specific. Don't use a word like, 'Beatles-esque'.' With Tame Impala, it's rather complicated to move beyond the label, but imagine an alternate universe where The Beatles played 'Tomorrow Never Knows' on Ed Sullivan. Moving on for there, the band exchanged flutes for synths, Yoko Ono for psychotropic soundscapes that spilt over the event horizon, arriving in our reality through the black hole we call a speaker. —James Vest"
    },
    {
      "artist": "Dum Dum Girls",
      "label": "HoZac/Sub Pop",
      "release": "I Will Be",
      "description": "2010 had a lot of 'girly' fronted bands and this one was at the top of the top. Great harmony, perfect pop songs. This record made me nostalgic for a time that was around before I was born, riding w/ my Johnny and his leather jacket. —Caitlin Lavin"
    },
    {
      "artist": "How To Dress Well",
      "label": "Lefse",
      "release": "Love Remains",
      "description": "This was quite possibly the most addicting album I’ve heard in a long time. Chicago Reader’s Miles Raymer put it quite nicely when he suggests that it sounds “like someone erased all the lead instruments from the multitrack recording of a big-budget pop song, leaving just atmospheric layers of textural overdubs, all drenched in reverb.” —Matt Wenzel"
    },
    {
      "artist": "Best Coast",
      "label": "Mexican Summer",
      "release": "Crazy for You",
      "description": "For those moments when you just can’t get that special someone out of your mind, here is a cutie lady, unlucky in love. Lyrics born from her break-up dangle with a lo-fi yet realistic teen-angsty pop. She wrote a letter, in twelve tracks, each under or at 3 minutes highlighting the ups and downs of a sensitive yet passionately adorable galpal lost in her mind about a boy. It’s just too too, opposed to so so! —Carolyna Wheat"
    },
    {
      "artist": "Deerhunter",
      "label": "4AD",
      "release": "Halcyon Digest",
      "description": "I'm a sucker for shoegaze / dream pop but this album will reach deep into your consciousness and change you. Right about halfway through, something clicks and the rest just falls into place. As with most things Bradford Cox has a hand in, it swirls and floats and lifts you up, lets you down easy. This album is, in its entirety, an impressive work of art. Its shimmering melodic texture ebbs and flows and the structure of each song builds on the last. Each wall of gorgeous harmonic sound and each progression feels so perfect, so well crafted. At the end you are rewarded by a majestic, shining prize in the epic piece, He Would Have Laughed. However, it's an ending that wouldn't be near as effective without every leading minute. —Kumar McMillan"
    },
    {
      "artist": "The Books",
      "label": "Temporary Residence",
      "release": "The Way Out",
      "description": "One of my favorite bands remains. I trust the Books. I can't imagine this gimmick's effect wearing off anytime soon either. The staple that will always keep the Books interesting is their humor. As long as they're funny, and not topically so, we'll remember this music. A surreal absurdity blesses their music in the same way Monty Python had the good graces of silliness. The effect is universal and timeless, and occasionally a laugh riot. —Dylan Peterson"
    },
    {
      "artist": "Broken Social Scene",
      "label": "Arts & Crafts",
      "release": "Forgiveness Rock Record",
      "description": "The Canadian collective employed John McEntire for production on their fourth proper album, and the Chicago brainchild did good here, by the band, and the listener. The band use all their weapons in ways familiar and unfamiliar, creating an indie-rock stew that goes from minimally electronic to brutally epic, post-punk to post-rock. It's an album for sorting through one's demons, and at the end they feel exorcised. —Austin Harvey"
    },
    {
      "artist": "Caribou",
      "label": "Merge",
      "release": "Swim",
      "description": "As soon as you hear the start of 'Odessa' off of Caribou's Swim, you're sold. Daniel Snaith, a former mathematician, puts his his big, number crunchin' brain to use by developing the most successful Caribou album yet--not to mention the live show is killer, filled with kaleidoscopic videos that will blow your miiiiiiind. —cloudsasha"
    },
    {
      "artist": "Delorean",
      "label": "True Panther Sounds",
      "release": "Subiza",
      "description": "Waves of sunny, pastel happiness from the Spanish former punk-rockers. It’s been said that great music transports you to other places. Whenever I listen to this album I want to be somewhere in southern Europe dancing on a beach. —Clarence Ewing"
    },
    {
      "artist": "Shearwater",
      "label": "Matador",
      "release": "The Golden Archipelago",
      "description": "Shearwater continues their growth from folk side project (from Jonathan Meiburgs former band, Okkervil River) to one of the most unique bands out there with this album.  Lushly orchestrated and densely lyrical, each song builds its own particular mood and atmosphere while Meiburg wails and howls and whispers above it.  The album moves effortlessly from gloriously uplifting to ominous and claustrophobic and back again. Essential tracks: 'Uniforms', 'God Made Me', 'Castaways' —Josh Lesser"
    },
    {
      "artist": "Sleigh Bells",
      "label": "Mom & Pop Music",
      "release": "Treats",
      "description": "Not only was this album the soundtrack to virtually every summer party I attended, but songs from it were also featured prominently on every road trip mix I heard this year. For good reason: the songs are chock full o' infectious grooves, thunderous guitar riffs, and sugary-sweet vocals. What more could you want from a pop record? I'll admit I was disappointed by Sleigh Bells' live performance at Pitchfork, but I dare you to play 'Crown on the Ground', 'A/B Machines', or 'Kids' without wanting to dance around your living room. I'm reasonably sure it's impossible. —Nicole Oppenheim"
    },
    {
      "artist": "Stornoway",
      "label": "4AD",
      "release": "Beachcomber’s Windowsill",
      "description": "There is such a richness to the record. More texture than sound. Best Song: 'The Coldharbour Road' —Micha Ward"
    },
    {
      "artist": "GAYNGS",
      "label": "Jagjaguwar",
      "release": "Relayted",
      "description": "2010 was a banner year for Justin Vernon. Playing cover tag with Peter Gabriel, having Kanye West decide to make 'Woods' the backbone of his penultimate track on his craziest album yet - but you could argue that it all started with him getting to have a little fun with GAYNGS. Not to say that anything on Relayted comes off as tongue-in-cheek; somehow, the band plays a tribute album to 10cc's I'm Not In Love with perfect conviction and execution. But “The Gaudy Side of Town” has a mournful 80’s sax wail, slinking bass, and all-high-hat scattered drums mixed with Vernon ditching his mournful winter hibernation voice for a whispery croon of schmaltzy sleaze, and you have to wonder if playing such a fun role didn't help send him into bigger superstardom (for better or worse). —Dan Morgridge"
    },
    {
      "artist": "Menomena",
      "label": "Barsuk",
      "release": "Mines",
      "description": "The fourth (or third) album from this Portland experimental pop trio is what resulted from a dark period in the personal lives of all the members. Ruptured relationships abound. Their eclectic approach to songwriting and instrumentation is magic in my ears, topped by huge, thumping, walloping drums. ('Taos' and 'Five Little Rooms') —Matt Garman"
    },
    {
      "artist": "Frightened Rabbit",
      "label": "Fat Cat",
      "release": "Winter of Mixed Drinks",
      "description": "The Scottish band added a member, beefed up their sound, got over a breakup, and the resultant record is their best. More confident, with still enough insecurity to create lyrics of self-doubt as well as self-assurance, Frightened Rabbit have mastered bringing in their folk influences into a full rock band setting. Empowering stuff for anyone getting past relationship troubles. —Austin Harvey"
    },
    {
      "artist": "Sharon Van Etten",
      "label": "Badabing",
      "release": "Epic",
      "description": "Sharon’s 2nd full-length outing is, indeed, gorgeously epic. I was lucky enough to catch her 6 or so months back at the now-legendary Chris Knox Stroke Benefit concert in NYC, and was impressed. Now, I’m bummed I missed her gig at Lincoln Hall supporting Junip. Word has she blew them off the stage. This LP has been on high-rotate and I’ll probably still be listening in decades to come. Standouts? Hard to choose, but if pressed, Peace Signs & One Day. —Owen Harris"
    }          
  ]
}