{
  "top_albums": [
    {
      "artist": "Animal Collective",
      "label": "Domino",
      "release": "Merriweather Post Pavillion",
      "description": "I’m not sure how they did it, Animal Collective went from being a band that I had a passing interest in and absolutely bored me at their live show to creating this surprisingly incredible album. The fact that Merriweather was released in January, and people are still freaking out about it at the end of the year is pretty impressive indeed. Well crafted, catchy, and outright fun, this record makes me happy. —Dustin Drase"
    },
    {
      "artist": "Neko Case",
      "label": "Anti",
      "release": "Middle Cyclone",
      "description": "Great vocals, great lyrics, great songs. She just hits the ball out of the park with this album. The singing is so emotive, and the melodies so evocative. —Tony Breed"
    },
    {
      "artist": "Phoenix",
      "label": "Glassnote",
      "release": "Wolfgang Amadeus Phoenix",
      "description": "Phoenix has been putting out bedrock-solid pop for years now, and if you always thought they’d be there for a few good spins, you’d be right. But few expected the Parisian duo to come out with an effort like Wolfgang Amadeus Phoenix – if they’d been your shy sidekick before, on this album – and 1901 in particular – they took off their glasses, did their hair, and asked you to prom. While the trajectory of the band has probably gotten more experimental than poppier (the inverse of say, Animal Collective’s recent acceptance into the indie-rock elite), it’s only been a small dapple. But it was enough to push a perennial pleaser into a true head-turner. —Dan Morgridge"
    },
    {
      "artist": "Pisces",
      "label": "Numero Group",
      "release": "A Lovely Sight",
      "description": "This is not a reissue, it’s a discovery of unheard 1969 material that was lost and buried in a fascinating story about a perfectionist rock group from Rockford, Illinois, who couldn’t catch a break. Besides earning Pisces a page in Steve Krakow’s Secret History of Chicago Music series, this album (compiled by the Numero crew) is an enjoyable listen start to finish and is essential for any fan of Rockadrome-esque swirly psychedelic fuzz. This album was built like a cathedral; it almost seems appropriate that it took over thirty years to finally see a proper release. Not only is this undisputedly my pick for best album of 2009, I think it will shine for years to come as a truly remarkable achievement both sonically and historically. — DJ Bylamplight"
    },
    {
      "artist": "Flaming Lips",
      "label": "Warner Bros.",
      "release": "Embryonic",
      "description": "If not the best record of the year, it was easily the most welcome. After the Technicolor dazzle of The Soft Bulletin and the serene trippiness of Yoshimi, the Lips lost me with 2005’s At War with the Mystics; it was fun, but I worried that the band had given themselves over entirely to cartoonish spectacle and Santa costumes at the cost of the songs. But here we have some spectacular new blood: not quite a return to form, or even a retreat to the olden days. Just a generous burst of the gloriously unpredictable weirdness that we’ve come to expect from Wayne Coyne & co., and it’s their best in 10 years. —Billy Kalb"
    },
    {
      "artist": "Yeah Yeah Yeahs",
      "label": "Interscope",
      "release": "It’s Blitz",
      "description": "I loved this album, but I never thought that the Grammy folks would agree with anything I think – to my surprise, It’s Blitz was just nominated for Best Alternative Music Album this month. —Jenny Lizak"
    },
    {
      "artist": "The Pains of Being Pure at Heart",
      "label": "Slumberland",
      "release": "Self-Titled",
      "description": "I love a pop song. Make it a nice, fuzzy, lyrically-nasty-but-sweet-sounding pop song with male-female vocals, and that’s even better. The best C86 record since, if not 1986, at least the last Velocity Girl album. —Shawn Campbell"
    },
    {
      "artist": "St. Vincent",
      "label": "4ad",
      "release": "Actor",
      "description": "Another artist that I saw play at Millenium Park this summer. It was fun watching parents dancing with their children to “Actor out of Work”. My parents took me to see The Osmonds so you can blame them if you don’t like this list. —Pete Zimmerman"
    },
    {
      "artist": "Andrew Bird",
      "label": "Fat Possum",
      "release": "Noble Beast",
      "description": "My brother claims he hates Andrew Bird because he feels like he needs a dictionary on hand in order to listen to his albums, but that’s precisely why I love Andrew Bird! That and I’m super envious of his whistlin’ skills.” —Erin Van Ness"
    },
    {
      "artist": "Dirty Projectors",
      "label": "Domino",
      "release": "Bitte Orca",
      "description": "‘Cannibal Resource’ was my summer jam, especially that part in the opening guitar riff where the Moogerfooger effect takes over. “BITTE ORCA / ORCA BITTE” was my scream-along lyric of 2009. it was a weird year. pop at its most disjointed and unhinged. lovely. —Austin Harvey"
    },
    {
      "artist": "Grizzly Bear",
      "label": "Warp",
      "release": "Veckatimest",
      "description": "A popular artist that I didn’t spend to much time with before, I thought they were too sleepy for me. Strive for perfection is apparent in this album, multiple layers, multiple voices – brilliant. “Two Weeks” is my song of the year – it puts a smile on my face every time I hear it. I especially love the “ooh-wee-ooh” doo-wop throw back vocals at the end. —Caitlin Lavin"
    },
    {
      "artist": "The Antlers",
      "label": "French Kiss",
      "release": "Hospice",
      "description": "It took me a long time to get into this album because I was being impatient and trying to listen to it on the commute to work, and you just can’t listen to this album in that environment. It’s too quiet and soft. Once I finally gave it a fair listen with a cup of coffee in hand in a moment of peace, it became magical to me. —Erin Van Ness"
    },
    {
      "artist": "Camera Obscura",
      "label": "4ad",
      "release": "My Maudlin Career",
      "description": "This album breaks my heart every time I hear it. Tracyanne Campbell’s voice is simply arresting. Of the eleven songs on the album, I called nine of them my favorite of the bunch at one time or another during the period that I spent steeping and soaking and immersing myself in this outstanding release. —David Staples"
    },
    {
      "artist": "Panda Bear",
      "label": "Paw Tracks",
      "release": "Tomboy",
      "description": "I was prepared to be underwhelmed by this album when it was first released. The knock on Noah Lennox’s follow up to his landmark album Person Pitch was that it’s “more of the same.” But sometimes that’s a good thing, especially when it comes from a gifted musician who continues to sharpen his electro-ambient-avant-pop craft. —Clarence Ewing"
    },
    {
      "artist": "Unknown Mortal Orchestra",
      "label": "Fat Possum",
      "release": "Unknown Mortal Orchestra",
      "description": "It takes guts to make a debut album this indecipherable. Garage production without the garage rock, this Kiwi-American trio have put together a quick half-hour of spare, danceable tunes penned by Flying Nun vet Ruban Nielson. UMO have hooks galore, but are just as content to ride the main riff of a track through the fade-out. —Austin Bainard Harvey"
    },
    {
      "artist": "Wye Oak",
      "label": "Merge",
      "release": "Civilian",
      "description": "'I still keep my baby teeth, In the bedside table with my jewelry, You still sleep in the bed with me, My jewelry, and my baby teeth. I don’t need another friend, When most of them I can barely keep up with. I’m perfectly able to hold my own hand, but I still can’t kiss my own neck. I wanted to give you everything but I still stand in awe of superficial things I wanted to love you like my mother’s mother’s mothers did…Civilian…' No explanation needed. —Bobby Evers"
    },
    {
      "artist": "Radiohead",
      "label": "Tiker Tape Ltd.",
      "release": "The King of Limbs",
      "description": "I would think that by now Radiohead would have worn out their ability to make this kind of music so well—you know, said everything they can say? Anyway, they haven’t. —Tony Breed"
    },
    {
      "artist": "The Decemberists",
      "label": "Capitol",
      "release": "The King Is Dead",
      "description": "Decemberists get rootsy, release one of their strongest efforts to date. —Al Gabor"
    },
    {
      "artist": "Timber Timbre",
      "label": "Arts & Crafts",
      "release": "Creep On Creepin’ On",
      "description": "If a young Elvis could have somehow been body swapped with Leonard Cohen, Elvis presumably would have ditched Rockabilly for Rhythm and Blues. Because such a situation isn’t possible, there’s Timber Timbre to put to rest what that scenario would have sounded like. The album is a haunted space–expansive, mysterious, and eerily exciting, making you want to cling to something you love. —James Vest"
    },
    {
      "artist": "Washed Out",
      "label": "Sub Pop",
      "release": "Within and Without",
      "description": "Ernest Greene’s got the voice and he fuses it seamlessly with electronics. It’s hard not to like this music. Every track does well. —Richard Paul"
    },
    {
      "artist": "Veronica Falls",
      "label": "Slumberland",
      "release": "Veronica Falls",
      "description": "Formulaic and catchy? No problem. Married types are unattainable. It’s okay. —John Schechinger"
    },
    {
      "artist": "Cults",
      "label": "In the Name of",
      "release": "Cults",
      "description": "Bouncy but creepy take on sixties girl group sound and themes. —Al Gabor"
    },
    {
      "artist": "Tennis",
      "label": "Fat Possum",
      "release": "Cape Dory",
      "description": "A lovely pop album from the adorable couple that is Tennis, Cape Dory is delightful, light, and fun. It’s about love. It sounds like summer. It makes you want to dance. I really enjoyed it. —Abbey Fox"
    },
    {
      "artist": "Yuck",
      "label": "Fat Possum",
      "release": "Yuck",
      "description": "It almost makes me feel yucky how much I’ve listened to Yuck in 2011, pun not intended. But why should I? They’ve earned their place on my playlists! Maybe it’s their delicious 90’s throwback garage rock sound or perhaps it’s Daniel Blumberg’s amazing fro that instantly reminds you of Sideshow Bob (not in a super creepy way, though). I cannot wait to hear what this London group does next. —Michelle Nadeau"
    },
    {
      "artist": "Disappears",
      "label": "kranky",
      "release": "Guider",
      "description": "Another year means another Disappears album on my top 10. This band, that we are all very lucky to have locally, just keeps getting better. There is a new album due in March and it makes me wonder if they will make it 3 for 3 on my list in 2012. —Andy Weber"
    },
    {
      "artist": "JC Brooks & The Uptown Sound",
      "label": "Bloodshot",
      "release": "Want More",
      "description": "Chicago’s favorite soul crooner is back in full force with the fabulous Uptown Sound for their first release on Bloodshot. The only thing better than this album is seeing these guys live. —Sara Miller"
    },
    {
      "artist": "Likki Li",
      "label": "LL",
      "release": "Wounded Rhymes",
      "description": "Lykke Li portrays her vulnerability with such passion on this album. “I Know Places” is one of my favorites. —Liz Smyth"
    },
    {
      "artist": "Tom Waits",
      "label": "ANTI-",
      "release": "Bad As Me",
      "description": "Waits’ collaborator/wife Kathleen Brennan laid down the law: no songs over 4 minutes. Well, a few creep over that mark, but concision leads to the sharpest songs Waits has created in a long time. From barroom balladeering to scuzzy blues to rockabilly, Waits is in control on his best album since Rain Dogs. -Mike Bennett"
    },
    {
      "artist": "Wilco",
      "label": "dBpm/ANTI",
      "release": "The Whole Love",
      "description": "Well when I first listened to this album I was blown away just by the fact that Wilco was able to excite me again. Just when I had written them off they pull me back in. Well done! —Andy Weber"
    }            
  ]
}