{
  "top_albums": [
    {
      "artist": "Animal Collective",
      "label": "Domino",
      "release": "Merriweather Post Pavilion",
      "description": "I’m not sure how they did it, Animal Collective went from being a band that I had a passing interest in and absolutely bored me at their live show to creating this surprisingly incredible album. The fact that Merriweather was released in January, and people are still freaking out about it at the end of the year is pretty impressive indeed. Well crafted, catchy, and outright fun, this record makes me happy. —Dustin Drase"
    },
    {
      "artist": "Neko Case",
      "label": "Anti",
      "release": "Middle Cyclone",
      "description": "Great vocals, great lyrics, great songs. She just hits the ball out of the park with this album. The singing is so emotive, and the melodies so evocative. —Tony Breed"
    },
    {
      "artist": "Phoenix",
      "label": "Glassnote",
      "release": "Wolfgang Amadeus Phoenix",
      "description": "Phoenix has been putting out bedrock-solid pop for years now, and if you always thought they’d be there for a few good spins, you’d be right. But few expected the Parisian duo to come out with an effort like Wolfgang Amadeus Phoenix – if they’d been your shy sidekick before, on this album – and 1901 in particular – they took off their glasses, did their hair, and asked you to prom. While the trajectory of the band has probably gotten more experimental than poppier (the inverse of say, Animal Collective’s recent acceptance into the indie-rock elite), it’s only been a small dapple. But it was enough to push a perennial pleaser into a true head-turner. —Dan Morgridge"
    },
    {
      "artist": "Flaming Lips",
      "label": "Warner Bros.",
      "release": "Embryonic",
      "description": "If not the best record of the year, it was easily the most welcome. After the Technicolor dazzle of The Soft Bulletin and the serene trippiness of Yoshimi, the Lips lost me with 2005’s At War with the Mystics; it was fun, but I worried that the band had given themselves over entirely to cartoonish spectacle and Santa costumes at the cost of the songs. But here we have some spectacular new blood: not quite a return to form, or even a retreat to the olden days. Just a generous burst of the gloriously unpredictable weirdness that we’ve come to expect from Wayne Coyne & co., and it’s their best in 10 years. —Billy Kalb"
    },
    {
      "artist": "Pisces",
      "label": "Numero Group",
      "release": "A Lovely Sight",
      "description": "This is not a reissue, it’s a discovery of unheard 1969 material that was lost and buried in a fascinating story about a perfectionist rock group from Rockford, Illinois, who couldn’t catch a break. Besides earning Pisces a page in Steve Krakow’s Secret History of Chicago Music series, this album (compiled by the Numero crew) is an enjoyable listen start to finish and is essential for any fan of Rockadrome-esque swirly psychedelic fuzz. This album was built like a cathedral; it almost seems appropriate that it took over thirty years to finally see a proper release. Not only is this undisputedly my pick for best album of 2009, I think it will shine for years to come as a truly remarkable achievement both sonically and historically. — DJ Bylamplight"
    },
    {
      "artist": "Yeah Yeah Yeahs",
      "label": "Interscope",
      "release": "Its Blitz!",
      "description": "I loved this album, but I never thought that the Grammy folks would agree with anything I think – to my surprise, It’s Blitz was just nominated for Best Alternative Music Album this month. —Jenny Lizak"
    },
    {
      "artist": "The Pains of Being Pure at Heart",
      "label": "Slumberland",
      "release": "The Pains of Being Pure at Heart",
      "description": "I love a pop song. Make it a nice, fuzzy, lyrically-nasty-but-sweet-sounding pop song with male-female vocals, and that’s even better. The best C86 record since, if not 1986, at least the last Velocity Girl album. —Shawn Campbell"
    },
    {
      "artist": "St. Vincent",
      "label": "4ad",
      "release": "Actor",
      "description": "Another artist that I saw play at Millenium Park this summer. It was fun watching parents dancing with their children to “Actor out of Work”. My parents took me to see The Osmonds so you can blame them if you don’t like this list. —Pete Zimmerman"
    },
    {
      "artist": "Andrew Bird",
      "label": "Fat Possum",
      "release": "Noble Beast",
      "description": "My brother claims he hates Andrew Bird because he feels like he needs a dictionary on hand in order to listen to his albums, but that’s precisely why I love Andrew Bird! That and I’m super envious of his whistlin’ skills.” —Erin Van Ness"
    },
    {
      "artist": "Dirty Projectors",
      "label": "Domino",
      "release": "Bitte Orca",
      "description": "‘Cannibal Resource’ was my summer jam, especially that part in the opening guitar riff where the Moogerfooger effect takes over. “BITTE ORCA / ORCA BITTE” was my scream-along lyric of 2009. it was a weird year. pop at its most disjointed and unhinged. lovely. —Austin Harvey"
    },
    {
      "artist": "Grizzly Bear",
      "label": "Warp",
      "release": "Veckatimest",
      "description": "A popular artist that I didn’t spend to much time with before, I thought they were too sleepy for me. Strive for perfection is apparent in this album, multiple layers, multiple voices – brilliant. “Two Weeks” is my song of the year – it puts a smile on my face every time I hear it. I especially love the “ooh-wee-ooh” doo-wop throw back vocals at the end. —Caitlin Lavin"
    },
    {
      "artist": "The Antlers",
      "label": "French Kiss",
      "release": "Hospice",
      "description": "It took me a long time to get into this album because I was being impatient and trying to listen to it on the commute to work, and you just can’t listen to this album in that environment. It’s too quiet and soft. Once I finally gave it a fair listen with a cup of coffee in hand in a moment of peace, it became magical to me. —Erin Van Ness"
    },
    {
      "artist": "Camera Obscura",
      "label": "4ad",
      "release": "My Maudlin Career",
      "description": "This album breaks my heart every time I hear it. Tracyanne Campbell’s voice is simply arresting. Of the eleven songs on the album, I called nine of them my favorite of the bunch at one time or another during the period that I spent steeping and soaking and immersing myself in this outstanding release. —David Staples"
    },
    {
      "artist": "Madness",
      "label": "Yep Roc",
      "release": "The Liberty of Norton Folgate",
      "description": "After bursting onto the scene as a frenetic ska band, Madness put its own stamp on British observational pop, providing a more urban and urbane (but less poetic) variation on the pastoral English paeans of Ray Davies and The Kinks. Years after their heyday, it’s amazing that these elder statesmen have as much to say as they do. The album loosely revolves around the concept of snapshots of London, which suitably inspired the band to whip up a number of songs that rank with their beloved singles from the ‘80s. It is all topped off by the 10 minute title cut, a genre hopping historical journey through a diverse London neighborhood that celebrates immigration as making a great city all the stronger. This great band finally pulls off the great album that was always in them. —Mike Bennett"
    },
    {
      "artist": "Thee Oh Sees",
      "label": "In The Red",
      "release": "Help",
      "description": "Thee Oh Sees have been a busy band. A couple of albums this year, a half dozen singles, and they have all been consistently good. This is a fine album all the way around. They are a garage band writing pop songs with a hint of psych thrown in and some great male and female vocals. They rip through a dozen songs and by the time you are done you are ready to start the album over again. —Patrick Seymour"
    },
    {
      "artist": "Noisettes",
      "label": "Mercury",
      "release": "Wild Young Hearts",
      "description": "I am a sucker for an album that moves through a variety of styles, and here the Noisettes are, pushing all of my buttons. Well‚ it’s more like an overview of Motown, with all the requisit hooks, but a dash of rock thrown in. Downsides: the album is a bit overproduced, particularly for a band known as one of the rowdiest live acts in London. And their disco-inflected hit, Don’t Upset the Rhythm (Go Baby Go), is a bit too slick, repetitive, and under-written for my taste (but I still groove to it every time it’s on, and never get the urge to skip to the next track). —Tony Breed"
    },
    {
      "artist": "Fanfarlo",
      "label": "Atantic",
      "release": "Reservoir",
      "description": "How many instruments did they use on this album?! Strings make it passionate.” —Carolyn Kassnoff"
    },
    {
      "artist": "The Decemberists",
      "label": "Capitol",
      "release": "Hazards of Love",
      "description": "You know what I love about the Decemberists? As they’ve gotten more popular, and switched to a major label (minor-major, perhaps), they’ve just gotten weirder. the Hazards of Love is not just a concept album, it’s an actual story told in song, like any one of the story-songs from Picaresque elongated into a full album. And it’s brilliant. It’s suffused with prog-rock goodness, and features guest vocals by Shara Worden of My Brightest Diamond and Becky Stark of Lavender Diamond. The one flaw? With Colin Meloy singing two roles and narrating, it’s a little hard to follow. Two more guest vocalists would have been welcome. (Ooh! Ooh! The Magnetic Fields’ Stephin Merritt as The Rake; would that not have been great?) —Tony Breed"
    },
    {
      "artist": "M Ward",
      "label": "Merge",
      "release": "Hold Time",
      "description": "He pleases me. —Laurie Viets"
    },
    {
      "artist": "Silversun Pickups",
      "label": "Dangerbird",
      "release": "Swoon",
      "description": "Yep, I thought it was a new Smashing Pumpkins song the first time I heard the Silversun Pickups. But my reluctance to investigate them further was worn down when I remembered, hey, I really liked the Pumpkins. The second chance I gave them was worth it, and I’ve been nothing but pleased. —Jenny Lizak"
    },
    {
      "artist": "C. Joynes",
      "label": "Bo’ Weavil",
      "release": "Revenants, Prodigies and the Restless Dead",
      "description": "A step outside my usual realm for this gorgeous, pastoral instrumental album from a young guitar player often compared to John Fahey. Perfect rainy day, time-to-think music. —Shawn Campbell"
    },
    { 
      "artist": "Avett Brothers",
      "label": "Columbia/American",
      "release": "I and Love and You",
      "description": "'Their Rick Rubin produced, major label debut may be a lot smoother and more polished than their previous efforts, but maybe the brothers are just growing up. It’s sing-songy and catchy so I don’t mind.' —Erin Van Ness … 'I and Love and You and Too' —Pete Zimmerman"
    },
    {
      "artist": "Elvis Perkins",
      "label": "XL",
      "release": "Elvis Perkins In Dearland",
      "description": "How creepy would it be being the son of Anthony Perkins? At what age was he allowed to see Psycho? Talk about scaring! It scared me and Norman Bates was not my dad! Well it did not effect him in his musical development. His voice does have a hauntingly beautiful quality. —Andy Weber"
    },
    {
      "artist": "Japandroids",
      "label": "Polyvinyl",
      "release": "Post-Nothing",
      "description": "I was shocked when I saw a five-minute running time for this song, which I’d previously brain-labeled as a sparse punk burner. And while the song could have potentially ended about two minutes in (the lyrics are basically just played twice in a row), the song gives itself a big bridge to ramp itself up with again, and takes off. This could have all been repetitive and grating, but the feedback fuzz, earnest yelps, and heart-on-sleeve lyrics (“Well you can keep tomorrow after tonight we’re not gonna need it…/Background, we’re too drunk to feel it”) catches your ear, plants itself, and waits for your next moment of triumph to blast back to memory as your victory soundtrack. —Dan Morgridge (Re: 'Young Hearts Spark Fire')"
    },
    {
      "artist": "Mi Ami",
      "label": "Quarterstick",
      "release": "Watersports",
      "description": "After a couple excellent EPs these ex-Black Eyes members put out their full length debut. It is a strange mix of forward thinking punk, Afro beat, free jazz and dub. While that makes it seem like they are throwing everything at the wall to see what sticks, it actually works well blending everything together creating a very unique sounding album, strong debut. —Patrick Seymour"
    },
    {
      "artist": "Micachu",
      "label": "Rough Trade",
      "release": "Jewellery",
      "description": "Just when you thought that the latest crop of post-punk revivalists had squeezed the last drop out of the sounds of the Ghosts of ‘78-‘82 Indie Past, along comes 21 year old Mica Levi to show that there are always new ways to cobble together dissonance and melody. Bits of the early Cure, The Fall, Orange Juice, Wire and others all collide and ping-pong about, while Mica is at turns wistful, cheeky and wise. Adding to the excitement is Mica’s distinctive oddball guitar playing. —Mike Bennett"
    },
    {
      "artist": "Woods",
      "label": "Woodsist",
      "release": "Songs of Shame",
      "description": "Just when you thought that the latest crop of post-punk revivalists had squeezed the last drop out of the sounds of the Ghosts of ‘78-‘82 Indie Past, along comes 21 year old Mica Levi to show that there are always new ways to cobble together dissonance and melody. Bits of the early Cure, The Fall, Orange Juice, Wire and others all collide and ping-pong about, while Mica is at turns wistful, cheeky and wise. Adding to the excitement is Mica’s distinctive oddball guitar playing. —Mike Bennett"
    },
    {
      "artist": "The Cave Singers",
      "label": "Matador",
      "release": "Welcome Joy",
      "description": "This is the second album from this Seattle band. They have a driving folk sound with some outstanding blues harp interludes throughout a number of their tracks. I am a lover of songs that build the whole way. Which is very evident to me when I look at this list. This is a song that I would listen to and back it up and listen to it again. In this day and age of music access that is something I rarely do so for that reason alone it sits a top my list. —Andy Weber"
    },
    {
      "artist": "Windmill",
      "label": "Friendly Fire Recordings",
      "release": "Epcot Starfields",
      "description": "Windmill’s sophomore album bridges the narrow gap between an optimistic future and a disappointing past. Science and technology create a majestic backdrop for tales we can all relate to; Tales of loss and disappointing everyone that is important to you. This delicate balance plays out perfectly in each song’s fragile composition. Simply put, I haven’t heard an album with this much depth in quite some time, and it quickly became the soundtrack of my summer commutes. —Mike Gibson"
    },
    {
      "artist": "National Skyline",
      "label": "Self-Released",
      "release": "Bliss & Death",
      "description": "National Skyline grew from the broken pieces of Hum. Only available through download, Bliss & Death is an epic and emotional roller coaster, and by far my personal favorite release from Nat. Skyline. It’s a shoegaze wall of sound flavored with layered guitar harmony. I can’t say enough. Ok… I’ll go ahead and say it: This is the best album I’ve heard in years. —David Staples"
    }            
  ]
}