{
  "top_albums": [
    {
      "artist": "tUnE-yArDs",
      "label": "4AD",
      "release": "W H O K I L L",
      "description": "As inventive as any album this year, Merrill Gerbus’ sound is a junkyard of Afro-Caribbean, R&B, Funk, and Modern Rock influences, though her voice maybe her music’s most unique quality. After her first album, BiRd-BrAiNs, found an audience despite being recorded on a digital voice recorder, Gerbus’ took advantage of her first studio-recorded release that turns tunes to treasure. —James Vest"
    },
    {
      "artist": "PJ Harvey",
      "label": "Vagrant",
      "release": "Let England Shake",
      "description": "This album is beautiful in its quiet grace, and the honesty of its lyrics. Even 9 months after its release these songs still get happily stuck in my head. —Liz Smyth"
    },
    {
      "artist": "Detroyer",
      "label": "Merge",
      "release": "Kaputt",
      "description": "I haven’t listened to any other album this year more than Kaputt. I am infatuated with every track here. I guess artistic audacity just gets me every time. I want to hear someone giving a crazy idea his all, even if that could potentially mean utter failure. Dan Bejar could’ve made the worst decision of his life by releasing Kaputt, but as long as listeners like me are around, we’ll make sure this isn’t the last time an artist doesn’t play it safe. Kaputt is my favorite album of the year. —Dylan Peterson"
    },
    {
      "artist": "The Joy Formidable",
      "label": "Atlantic/Canvasback",
      "release": "The Big Roar",
      "description": "Giant, swirling walls of guitar and a tremendous sense of intensity, that great build-up and release, made The Big Roar perhaps the best shoegaze album since the heyday of My Bloody Valentine and Slowdive. —Shawn Campbell"
    },
    {
      "artist": "The War on Drugs",
      "label": "Secretly Canadian",
      "release": "Slave Ambient",
      "description": "Springsteen, Dylan, Petty are the common comparisons…but with a hypnotic bend. Roadtrip music that makes you drive faster…be safe, use cruise control instead. —David Staples"
    },
    {
      "artist": "The Weeknd",
      "label": "XL",
      "release": "House of Balloons",
      "description": "The debut mixtape from Toronto’s mysterious The Weeknd spread through the interwebs like wildfire. House of Balloons collected over 200,000 downloads in a matter of weeks and quickly made these guys into a household name. It’s easy to see why. As far as contemporary R&B goes there aren’t too many artists, The-Dream aside, that are doing stuff like this. The beats are so good they might buckle your knees if you’re not prepared, and when combined with Abel Tesfaye’s considerable pipes and a penchant for darker subject matter this stuff becomes downright sinister in the best way possible. —Stephen Dobek"
    },
    {
      "artist": "M83",
      "label": "Mute",
      "release": "Hurry Up, We’re Dreaming",
      "description": "Anthony Gonzalez reimagines the grooves of the 80s and makes them sound new again. The child-like “Raconte-Moi Une Histoire” might be my favorite song of the year. —Erin Van Ness"
    },
    {
      "artist": "Wild Flag",
      "label": "Merge",
      "release": "Wild Flag",
      "description": "As good as Sleater-Kinney? Yes. —John Schechinger"
    },
    {
      "artist": "Cave",
      "label": "Drag City",
      "release": "Neverendless",
      "description": "Since these guys have been hammering away in Chicago for years now, you wouldn’t have thought this album’s greatness would have taken anyone by surprise, but Neverendless felt like it came out of nowhere – slamming into your senses like the 2-ton flatbed truck that Cave commandeered to share its new songs with the city. Crisp and clear production with impossibly tight songs. Somehow these epic jams all seem to end too quickly! —John Lombardo"
    },
    {
      "artist": "Colin Stetson",
      "label": "Constellation",
      "release": "New History Warfare Vol. 2: Judges ",
      "description": "The most unique and exciting album I heard this year hands down. This is music I’ve never experienced before and the fact that it comes from one musician, playing one instrument, recorded in one take is absolutely mind-blowing. —Mike Pakowski"
    },
    {
      "artist": "Fleet Foxes",
      "label": "Sub Pop",
      "release": "Helplessness Blues",
      "description": "Seattle outfit Fleet Foxes sophomore effort is the perfect soundtrack to a lazy Sunday morning. The Foxes effortlessly evoke the feel of early 70’s light rock bands like Crosby, Stills & Nash. Check out the warm vocal harmonies on the albums title track, “Helplessness Blues.” —Jim Waiter"
    },
    {
      "artist": "James Blake",
      "label": "Universal Republic",
      "release": "James Blake",
      "description": "Staying with the theme of amazing UK-ness, but completely changing, well, everything, the music of James Blake has had a huge impact on 2011. Not only has he stretched the genre of dub-step into a calmer territory, much more accessible to all, but the kid is brilliant! At the time of the release in February, he was 21! And now, he’s a household name. Well, a household name in my shabby apartment. —Michelle Nadeau"
    },
    {
      "artist": "Kurt Vile",
      "label": "Matador",
      "release": "Smoke Ring for My Halo",
      "description": "Hey, guitars! Yeah, that’s an instrument for old dudes, but Kurt Vile doesn’t care. He knows how to write a great song with his guitar, and he should continue. Kurt has an aura that you can’t really fuck with. The timelessness of songwriting wins again here, whether you’re a fan of Bruce Springsteen, Sonic Youth, or Arcade Fire, Kurt Vile’s music somehow stretches across decades of rock and roll cool and comes back with a uniquely original style. —Dylan Peterson"
    },
    {
      "artist": "Panda Bear",
      "label": "Paw Tracks",
      "release": "Tomboy",
      "description": "I was prepared to be underwhelmed by this album when it was first released. The knock on Noah Lennox’s follow up to his landmark album Person Pitch was that it’s “more of the same.” But sometimes that’s a good thing, especially when it comes from a gifted musician who continues to sharpen his electro-ambient-avant-pop craft. —Clarence Ewing"
    },
    {
      "artist": "Unknown Mortal Orchestra",
      "label": "Fat Possum",
      "release": "Unknown Mortal Orchestra",
      "description": "It takes guts to make a debut album this indecipherable. Garage production without the garage rock, this Kiwi-American trio have put together a quick half-hour of spare, danceable tunes penned by Flying Nun vet Ruban Nielson. UMO have hooks galore, but are just as content to ride the main riff of a track through the fade-out. —Austin Bainard Harvey"
    },
    {
      "artist": "Wye Oak",
      "label": "Merge",
      "release": "Civilian",
      "description": "'I still keep my baby teeth, In the bedside table with my jewelry, You still sleep in the bed with me, My jewelry, and my baby teeth. I don’t need another friend, When most of them I can barely keep up with. I’m perfectly able to hold my own hand, but I still can’t kiss my own neck. I wanted to give you everything but I still stand in awe of superficial things I wanted to love you like my mother’s mother’s mothers did…Civilian…' No explanation needed. —Bobby Evers"
    },
    {
      "artist": "Radiohead",
      "label": "Tiker Tape Ltd.",
      "release": "The King of Limbs",
      "description": "I would think that by now Radiohead would have worn out their ability to make this kind of music so well—you know, said everything they can say? Anyway, they haven’t. —Tony Breed"
    },
    {
      "artist": "The Decemberists",
      "label": "Capitol",
      "release": "The King Is Dead",
      "description": "Decemberists get rootsy, release one of their strongest efforts to date. —Al Gabor"
    },
    {
      "artist": "Timber Timbre",
      "label": "Arts & Crafts",
      "release": "Creep On Creepin’ On",
      "description": "If a young Elvis could have somehow been body swapped with Leonard Cohen, Elvis presumably would have ditched Rockabilly for Rhythm and Blues. Because such a situation isn’t possible, there’s Timber Timbre to put to rest what that scenario would have sounded like. The album is a haunted space–expansive, mysterious, and eerily exciting, making you want to cling to something you love. —James Vest"
    },
    {
      "artist": "Washed Out",
      "label": "Sub Pop",
      "release": "Within and Without",
      "description": "Ernest Greene’s got the voice and he fuses it seamlessly with electronics. It’s hard not to like this music. Every track does well. —Richard Paul"
    },
    {
      "artist": "Veronica Falls",
      "label": "Slumberland",
      "release": "Veronica Falls",
      "description": "Formulaic and catchy? No problem. Married types are unattainable. It’s okay. —John Schechinger"
    },
    {
      "artist": "Cults",
      "label": "In the Name of",
      "release": "Cults",
      "description": "Bouncy but creepy take on sixties girl group sound and themes. —Al Gabor"
    },
    {
      "artist": "Tennis",
      "label": "Fat Possum",
      "release": "Cape Dory",
      "description": "A lovely pop album from the adorable couple that is Tennis, Cape Dory is delightful, light, and fun. It’s about love. It sounds like summer. It makes you want to dance. I really enjoyed it. —Abbey Fox"
    },
    {
      "artist": "Yuck",
      "label": "Fat Possum",
      "release": "Yuck",
      "description": "It almost makes me feel yucky how much I’ve listened to Yuck in 2011, pun not intended. But why should I? They’ve earned their place on my playlists! Maybe it’s their delicious 90’s throwback garage rock sound or perhaps it’s Daniel Blumberg’s amazing fro that instantly reminds you of Sideshow Bob (not in a super creepy way, though). I cannot wait to hear what this London group does next. —Michelle Nadeau"
    },
    {
      "artist": "Disappears",
      "label": "kranky",
      "release": "Guider",
      "description": "Another year means another Disappears album on my top 10. This band, that we are all very lucky to have locally, just keeps getting better. There is a new album due in March and it makes me wonder if they will make it 3 for 3 on my list in 2012. —Andy Weber"
    },
    {
      "artist": "JC Brooks & The Uptown Sound",
      "label": "Bloodshot",
      "release": "Want More",
      "description": "Chicago’s favorite soul crooner is back in full force with the fabulous Uptown Sound for their first release on Bloodshot. The only thing better than this album is seeing these guys live. —Sara Miller"
    },
    {
      "artist": "Likki Li",
      "label": "LL",
      "release": "Wounded Rhymes",
      "description": "Lykke Li portrays her vulnerability with such passion on this album. “I Know Places” is one of my favorites. —Liz Smyth"
    },
    {
      "artist": "Tom Waits",
      "label": "ANTI-",
      "release": "Bad As Me",
      "description": "Waits’ collaborator/wife Kathleen Brennan laid down the law: no songs over 4 minutes. Well, a few creep over that mark, but concision leads to the sharpest songs Waits has created in a long time. From barroom balladeering to scuzzy blues to rockabilly, Waits is in control on his best album since Rain Dogs. -Mike Bennett"
    },
    {
      "artist": "Wilco",
      "label": "dBpm/ANTI",
      "release": "The Whole Love",
      "description": "Well when I first listened to this album I was blown away just by the fact that Wilco was able to excite me again. Just when I had written them off they pull me back in. Well done! —Andy Weber"
    }            
  ]
}