{
  "top_albums": [
    {
      "artist": "Tame Impala",
      "label": "Modular",
      "release": "Lonerism",
      "description": "Psych rockers rejoice, this is what it's all been leading up to. It's Rubber Soul on more drugs. It's Dungen in English. It's everything that psych rock can and ought to be, and even better than that. The sound here is so big, it makes me wonder why everyone has been holding back for so long. I'll admit, I've never been a huge psych fan, but, it has never sounded like Lonerism before. The crunchy electric guitar, rollicking drum fills, reverberating keyboards, punctuating bass, soaring falsetto, and melodies that the Kinks couldn't dream up. It's a joy to listen to this album, from start to finish and on repeat. --Dylan Peterson"
    },
    {
      "artist": "Japandroids",
      "label": "Polyvinyl",
      "release": "Celebration Rock",
      "description": "Clocking in at just over 35 minutes, this record is a short and sweet nonstop party. Perfect for 35 minute party people? Bad jokes aside, each song is raw, full of energy, and so well-produced that the band might as well be performing in your head. Seriously. The tracks are that clear. This is some great alt-rock that recalls how you felt back when you were 15 and would rock out to your favorite records. You'd feel free, you'd dance, you'd sing off-key (because who cares?), and you'd be confident that you were the coolest person in the world at that particular moment. Wanna feel like that again? Put this record on. You'll thank me later. --Nicole Oppenheim"
    },
    {
      "artist": "Royal Headache",
      "label": "What’s Yr Rupture?",
      "release": "Royal Headache",
      "description": "Originally released in their native Australia in late 2011, I’m counting that Royal Headache is one of my favorite records of 2012, thanks to the US re-issue from What’s Yr Rupture. The best description I’ve heard about Royal Headache - a rawkous garage rock if it was fronted by Rod Stewart. Singer “Shogun” has a voice that’s soulful, urgent and warm - it’s the best thing garage has going in 2012. --Caitlin Lavin"
    },
    {
      "artist": "Wild Nothing",
      "label": "Captured Tracks",
      "release": "Nocturne",
      "description": "Further solidifying his place in the Dream-Pop scene, the 2nd album from Wild Nothing (aka Jack Tatum) features more of the refined, polished, relentlessly gentle sound (a combination of jangle-pop guitars and synth-based bass and drums) he first emerged with in 2010. This is one of the all-around best sonically crafted albums I've heard this year. --Clarence Ewing"
    },
    {
      "artist": "Frank Ocean",
      "label": "Def Jam",
      "release": "channel ORANGE",
      "description": "About one month ago, I was out and about in Milwaukee celebrating a friend's birthday, and when we ended up back at the home of our hostess she put on Frank Ocean. Everyone, and I mean everyone, even the people I'd seen only peripherally since graduating high school, immediately launched into drunken singalong to 'Thinking About You,' even the falsetto chorus. There were champagne and feelings all over the place. It was nice. --Maddie Hannes"
    },
    {
      "artist": "Beach House",
      "label": "Bella Union",
      "release": "Bloom",
      "description": "Beach House continue their path of making sublime, whispering, flowing beautiful music. Not much to say, highly recommended. --Jim Waiter"
    },
    {
      "artist": "Dirty Projectors",
      "label": "Domino",
      "release": "Swing Lo Magellan",
      "description": "I loved 'Bita Orca,'' but I wasn't sure what to expect after hearing the first single from Swing Lo Magellan, 'Gun Has No Trigger.' The complex instrumentation and vocal interplay are still there, but this album is a step in a whole new direction. The instruments are sparse, the vocals are dense and the lyrical imagery is dark. One of the best records in years. --Curtis Swank"
    },
    {
      "artist": "Azaelia Banks",
      "label": "Interscope",
      "release": "1991",
      "description": "This is the kind of record that makes me fairly certain I've wasted my life. It's called 1991 because that's the year the artist was born. *sigh* Kids these days. Despite her young age, Ms. Banks is an accomplished musician, having trained at the LaGuardia High School for Performing Arts in her native NYC. No wonder her 4-song EP was enough to get her a #3 spot on my list this year. Each track is a booty-shakin' fun bomb with infinitely more chops than the over-produced dreck you'll hear on most dance-centric radio stations these days. That said, she has drawn many comparisons with Nicki Minaj, which I can see, but don't agree with. Where Minaj is all spectacle and vinyl dresses, Banks is all business. Her first solo record drops this coming February and I can't wait to pick it up. Released on Polydor/Interscope, you know it's going to be some quality stuff. Oh, and Nicki? Watch your back, girl. There's a new sheriff in town. --Nicole Oppenheim"
    },
    {
      "artist": "Django Django",
      "label": "Ribbon Music",
      "release": "Django Django",
      "description": "Out of London...Their album was released back in January and due to the saturated world of music the ears at CHIRP did not pick up on it until a little later. But wow! Very diverse within the album. --Andy Weber"
    },
    {
      "artist": "Michael Kiwanuka",
      "label": "Interscope",
      "release": "Home Again",
      "description": "In an age where everyone sounds like a tribute band, a 24 year-old Anglo-Ugandan with the voice of Bill Withers, playing sophisticated soulful jazz and folk is a long, cool drink of The Real Thing. This amazing debut album from a man who’s talent may propel him to become an Amy-Winehouse-sized sensation. --James Vest"
    },
    {
      "artist": "Echo Lake",
      "label": "Slumberland Records",
      "release": "Wild Peace",
      "description": "Echo Lake’s Wild Peace is pure captivating dreamscape. This was an easy number one slot filler since it’s an album I came to again and again and not just for the catchy singles. Listening to this album can easily be equated to sitting in a reclining chair while soaking in the sunshine. --Katie Owens"
    },
    {
      "artist": "The White Wires",
      "label": "Dirtnap",
      "release": "World War III",
      "description": "The White Wires are a Canadian garage rock band from Ontario, Canada. This album and The White Wires for the most part, blends old school Ramones-era punk rock with pop, but calling them a pop-punk band is a misnomer. All 14 tracks are evenly balanced, and incredibly re-playable, with fun/energetic bass lines and smooth lyrics of nostalgia and girls. --Nathan Hennon"
    },
    {
      "artist": "Neneh Cherry & the Thing",
      "label": "Smalltown Supersound",
      "release": "The Cherry Thing",
      "description": "Free jazz isn’t normally my thing (ahem), but this collaboration between the ever-exploring Neneh Cherry and the Swedish trio that named itself after one of her stepdad’s compositions completely won me over. The set is made up mainly of a fascinating array of covers (the Stooges, MF Doom, aforementioned stepdad Don Cherry), with the outstanding offering Cherry’s reading of Suicide’s “Dream Baby Dream,” backed up by minimalist upright bass and drums, with an increasingly skronky sax eventually taking over before Cherry reins things back in – a track that seems to go on forever, yet I’m never ready for it to end. --Shawn Campbell"
    },
    {
      "artist": "Fiona Apple",
      "label": "Epic",
      "release": "The Idler Wheel Is Wiser Than the Driver of the Screw and Whipping Cords Will Serve You More Than Ropes Will Ever Do",
      "description": "Powerful but austere, Fiona Apple’s all-acoustic fourth album out Kanye’s Kanye in it’s deeply personal, painfully honest portrait of an artist biting themselves and the ones around them to feed their ravenous love of their craft. --James Vest"
    },
    {
      "artist": "The Men",
      "label": "Sacred Bones",
      "release": "Open Your Heart",
      "description": "A successful sophomore concept from this NY group - filled with aggressive rock and punk, to krautrock instrumentals to even a country ballad (though some find the last one a mis-step). This is definitely my record of 2012. --Caitlin Lavin"
    },
    {
      "artist": "Angel Olsen",
      "label": "Bathetic Records",
      "release": "Half Way Home",
      "description": "Chicago's Angel Olsen's haunting voice seems to crackle with hints of unused power reserves hiding just beneath the surface. She's already slaying me and she's got so much left in the tank! Beautiful, pensive, dark blue Americana. --Dave Staples"
    },
    {
      "artist": "Panoramic & True",
      "label": "Raymond Roussel Records",
      "release": "Wonderlust",
      "description": "These guys took my top spot because local trumps everything. This is their second album and they create an incredibly lush sound. I would like to see them get some more notoriety within the local scene. There is a lot of talent here. --Andy Weber"
    },
    {
      "artist": "California Wives",
      "label": "Vagrant",
      "release": "Art History",
      "description": "Here's the deal: The debut album from this Chicago band isn't going to solve the crisis in the middle east. It won't move mountains. And it definitely won't be the number one listened to album on Spotify. But I'm not giving it this top ten classification for any of these reasons. What this album is, is good. No, it's great. Any album that just makes you want to sing your heart out and dance like you are in high school, to me, is worth it's weight in gold. Indie pop rock gold. --Michelle Nadeau"
    },
    {
      "artist": "Limiñanas",
      "label": "HoZac",
      "release": "Crystal Anis",
      "description": "Upping the ante on the sophomore album, this expanded duo combine electro-mechanical organs, shimmery guitars, banjo, along with whispered French lyrics. The closest approximation of their intoxicating live show yet! --John Lombardo"
    },
    {
      "artist": "Outer Minds",
      "label": "Southpaw",
      "release": "S/T",
      "description": "I was thrilled to discover local act Outer Minds early in 2012, and they rewarded me with some fantastic live shows, as well as two full-length albums. I liked both a lot, but my favorite was their first, a poppier affair full of Nuggets-style hooks and Mamas and Papas harmonies. --Shawn Campbell"
    },
    {
      "artist": "Grimes",
      "label": "4AD",
      "release": "Visions",
      "description": "Like nothing else, Claire's majestic soundscapes charm the pants off me like a Boucher painting. It may not be rococo, but has all the intimacy of a sexy seance on really good natural meds. The more I listen, the more hypnotic it becomes. Sometimes it unintentionally comes on like bubblegum goth. This must be some kind of genius. Bewitchingly intimate, beautiful at times, Visions works on all sorts of levels and seasons. --Jonny Madness"
    },
    {
      "artist": "Black Marble",
      "label": "Hardly Art",
      "release": "A Different Arrangement",
      "description": "Ice-cold synth pop never sounded so warm. This electro-goth album sounds like it came directly from the early 80's. The vocals sound like they were recorded through an air duct from across the building with the fan on. I hear the Cure here, I hear a melodic & more hopeful incarnation of Joy Division. So much synth! So much upbeat darkness! --Dave Staples"
    },
    {
      "artist": "The Ravonettes",
      "label": "Vice",
      "release": "Observator",
      "description": "Danish duo drew me in on this one......I like it a lot. Shoegazey, Echoey. --Jim Klososky"
    },
    {
      "artist": "Mazes",
      "label": "Parasol",
      "release": "Mazes Blazes",
      "description": "Pair the unique brand of Chicago chamber-twee cuteness exemplified by The 1900s, Canasta, and Scotland Yard Gospel Choir with the breakneck lunacy of Guided By Voices or The Olivia Tremor Control's best work, and you get an idea of what was the Windy City's best record of 2012. Sharing members with The 1900s, this wacky selection of adorable tunes would fit awkwardly in a Glasgow coffeeshop, or perfectly in a Dunedin pub. At its heart Blazes is a sweet selection of indie-pop glory, with enough changes in attitude and tempo to keep the listener off-balance. --Austin Bainard Harvey"
    },
    {
      "artist": "Cloud Nothings",
      "label": "Carpark",
      "release": "Attack on Memory ",
      "description": "A great psych-garage release from Cleveland punks. --Jim Klososky"
    },
    {
      "artist": "Titus Andronicus",
      "label": "XL",
      "release": "Local Business",
      "description": "I was a passive fan of this band until I heard Local Business. This album is filled with punk sensibilities and stream of consciousness lyrics about American life. It's really hard to top the passion emitted on this record. --Curtis Swank"
    }            
  ]
}