{
  "top_albums": [
    {
      "artist": "Tame Impala",
      "label": "Modular",
      "release": "Lonerism",
      "description": "Psych rockers rejoice, this is what it's all been leading up to. It's Rubber Soul on more drugs. It's Dungen in English. It's everything that psych rock can and ought to be, and even better than that. The sound here is so big, it makes me wonder why everyone has been holding back for so long. I'll admit, I've never been a huge psych fan, but, it has never sounded like Lonerism before. The crunchy electric guitar, rollicking drum fills, reverberating keyboards, punctuating bass, soaring falsetto, and melodies that the Kinks couldn't dream up. It's a joy to listen to this album, from start to finish and on repeat. --Dylan Peterson"
    },
    {
      "artist": "Japandroids",
      "label": "Polyvinyl",
      "release": "Celebration Rock",
      "description": "Clocking in at just over 35 minutes, this record is a short and sweet nonstop party. Perfect for 35 minute party people? Bad jokes aside, each song is raw, full of energy, and so well-produced that the band might as well be performing in your head. Seriously. The tracks are that clear. This is some great alt-rock that recalls how you felt back when you were 15 and would rock out to your favorite records. You'd feel free, you'd dance, you'd sing off-key (because who cares?), and you'd be confident that you were the coolest person in the world at that particular moment. Wanna feel like that again? Put this record on. You'll thank me later. --Nicole Oppenheim"
    },
    {
      "artist": "Royal Headache",
      "label": "What’s Yr Rupture?",
      "release": "Royal Headache",
      "description": "Originally released in their native Australia in late 2011, I’m counting that Royal Headache is one of my favorite records of 2012, thanks to the US re-issue from What’s Yr Rupture. The best description I’ve heard about Royal Headache - a rawkous garage rock if it was fronted by Rod Stewart. Singer “Shogun” has a voice that’s soulful, urgent and warm - it’s the best thing garage has going in 2012. --Caitlin Lavin"
    },
    {
      "artist": "Wild Nothing",
      "label": "Captured Tracks",
      "release": "Nocturne",
      "description": "Further solidifying his place in the Dream-Pop scene, the 2nd album from Wild Nothing (aka Jack Tatum) features more of the refined, polished, relentlessly gentle sound (a combination of jangle-pop guitars and synth-based bass and drums) he first emerged with in 2010. This is one of the all-around best sonically crafted albums I've heard this year. --Clarence Ewing"
    },
    {
      "artist": "Frank Ocean",
      "label": "Def Jam",
      "release": "channel ORANGE",
      "description": "About one month ago, I was out and about in Milwaukee celebrating a friend's birthday, and when we ended up back at the home of our hostess she put on Frank Ocean. Everyone, and I mean everyone, even the people I'd seen only peripherally since graduating high school, immediately launched into drunken singalong to 'Thinking About You', even the falsetto chorus. There were champagne and feelings all over the place. It was nice. --Maddie Hannes"
    }         
  ]
}